   - [#  21] ROR src.graph_utils: 
--------------------------------------------------------------------------------
  36:     if not (has_euler_path(graph)):
  37:         return False
  38:     
  39:     odd_degree_count = sum((1 for v in graph.nodes() if graph.degree(v) % 2 != 0))
- 40:     return odd_degree_count == 0
+ 40:     return odd_degree_count != 0
  41: 
  42: 
  43: def get_euler_start_vertex(graph: nx.Graph) -> int:
  44:     '''Return the starting vertex for Euler path traversal.
--------------------------------------------------------------------------------
[0.32355 s] killed by tests/test_graph_utils.py::TestHasEulerCircuit::test_triangle_has_euler_circuit
